build/docs/runtime/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>RUNTIME</title>
<!-- 2019-04-09 Tue 14:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../style/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../style/css/bootstrap.mini.css"/>
<link rel="stylesheet" type="text/css" href="../style/css/labtheme.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">RUNTIME</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Web:</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Layouts</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">1st Layout:</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Introduction and discussion of steps involved in MergeSort algorithm.
</li>
<li>The next Layouts focus on explaination of subparts of Mergesort algorithm. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">2nd Layout:</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Explaination of split of Mergesort algorithm.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">3rd Layout:</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>An interactive exercise on split of MergeSort algorithm.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">4th Layout:</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>This Layout explains the merge (subpart of MergeSort).
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5">5th Layout:</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>The fifth Layout provides an interactive exercise on merge.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6">6th Layout:</h4>
<div class="outline-text-4" id="text-1-1-6">
<ul class="org-ul">
<li>The sixth Layout demonstrates the basic mergesort by asking the user to give an input array.
</li>
<li>When the user enters an array and clicks on the 'sort' button, then mergesort graph is displayed.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7">7th Layout:</h4>
<div class="outline-text-4" id="text-1-1-7">
<ul class="org-ul">
<li>The seventh Layout provides an interactive exercise for mergesort algorithm.
</li>
<li>It allows the user to move to the next slide only if has completed correctly the exercise.
</li>
<li>The user will be provided a check button to check his answer.
</li>
<li>The check informs the user whether is answer is correct or not.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-8" class="outline-4">
<h4 id="sec-1-1-8">8th Layout:</h4>
<div class="outline-text-4" id="text-1-1-8">
<ul class="org-ul">
<li>Derive and explain the time complexity equation for mergesort algorithm.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-9" class="outline-4">
<h4 id="sec-1-1-9">9th Layout:</h4>
<div class="outline-text-4" id="text-1-1-9">
<ul class="org-ul">
<li>Derive the time complexity for split subpart of mergesort algorithm.
</li>
<li>Calculate the order of computation of split for a general array of size 'n'.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-10" class="outline-4">
<h4 id="sec-1-1-10">10th Layout:</h4>
<div class="outline-text-4" id="text-1-1-10">
<ul class="org-ul">
<li>Derive the time complexity for merge subpart of mergesort algorithm.
</li>
<li>Calculate the order of computation of merge for a general array of size 'n'.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-11" class="outline-4">
<h4 id="sec-1-1-11">11th Layout:</h4>
<div class="outline-text-4" id="text-1-1-11">
<ul class="org-ul">
<li>Derive the order of time complexity of mergesort algorithm.
</li>
<li>In this Layout time complexity of mergesort algorithm is derived by using the time complexity of split and merge subparts.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-12" class="outline-4">
<h4 id="sec-1-1-12">12th Layout:</h4>
<div class="outline-text-4" id="text-1-1-12">
<ul class="org-ul">
<li>Calculate the time required for computation of mergesort time for some array.
</li>
<li>Prove that the calculated value using formula and the computed value using the mergesort graph are the same.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-13" class="outline-4">
<h4 id="sec-1-1-13">13th Layout:</h4>
<div class="outline-text-4" id="text-1-1-13">
<ul class="org-ul">
<li>Plot the graph of complexity of mergesort against 'n'.
</li>
<li>Explain the variation of mergesort complexity with no of elements.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-14" class="outline-4">
<h4 id="sec-1-1-14">14th Layout:</h4>
<div class="outline-text-4" id="text-1-1-14">
<ul class="org-ul">
<li>Plot of various sorting algorithms in one graph.
</li>
<li>Explain why mergesort is more efficient than other sorting algorithms.
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Images:</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>All the images required for the mergesort tutorial for present in the <code>images</code> folder.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Node Modules</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Contains all the required packages of <code>d3.js</code>, <code>graphlib</code>, <code>dagre</code>, <code>dagre-d3</code> etc. 
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-12-04 MON]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2019-04-09 Tue 14:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
